-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Хост: localhost
-- Время создания: Май 21 2024 г., 10:17
-- Версия сервера: 8.0.31
-- Версия PHP: 7.4.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `ivi`
--

-- --------------------------------------------------------

--
-- Структура таблицы `country_movie`
--

CREATE TABLE `country_movie` (
  `id_movie` int NOT NULL,
  `id_country` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `country_movie`
--

INSERT INTO `country_movie` (`id_movie`, `id_country`) VALUES
(1, 1),
(2, 1),
(3, 1),
(4, 1),
(5, 1),
(6, 1),
(8, 1),
(9, 1),
(77, 1),
(78, 1),
(37, 2),
(46, 2),
(55, 2),
(73, 2),
(86, 2),
(96, 2),
(116, 2),
(124, 2),
(53, 3),
(59, 3),
(82, 3),
(116, 3),
(10, 4),
(17, 4),
(18, 4),
(21, 4),
(22, 4),
(23, 4),
(24, 4),
(25, 4),
(61, 4),
(62, 4),
(95, 4),
(102, 4),
(83, 5),
(105, 5),
(118, 5),
(119, 5),
(20, 6),
(68, 6),
(112, 6),
(14, 7),
(32, 7),
(36, 7),
(80, 7),
(115, 7),
(32, 8),
(41, 8),
(48, 8),
(49, 8),
(36, 9),
(40, 9),
(64, 9),
(66, 9),
(82, 9),
(110, 9),
(112, 9),
(118, 9),
(12, 10),
(26, 10),
(27, 10),
(28, 10),
(29, 10),
(61, 10),
(84, 10),
(103, 10),
(111, 10),
(39, 11),
(45, 11),
(7, 12),
(47, 12),
(109, 12),
(88, 13),
(96, 13),
(11, 14),
(13, 14),
(85, 14),
(86, 14),
(95, 14),
(104, 14),
(117, 14),
(15, 15),
(39, 15),
(77, 15),
(91, 15),
(67, 16),
(73, 16),
(77, 16),
(80, 16),
(113, 16),
(116, 16),
(43, 17),
(76, 17),
(79, 17),
(82, 17),
(47, 18),
(63, 18),
(79, 18),
(114, 18),
(50, 19),
(65, 19),
(101, 19),
(108, 19),
(37, 21),
(45, 21),
(50, 21),
(58, 21),
(67, 21),
(72, 21),
(78, 21),
(87, 21),
(113, 21),
(58, 22),
(88, 22),
(42, 23),
(47, 23),
(70, 23),
(32, 24),
(37, 24),
(42, 24),
(92, 24),
(41, 25),
(53, 25),
(56, 25),
(87, 25),
(92, 25),
(99, 25),
(100, 25),
(120, 25),
(56, 26),
(100, 26),
(110, 26),
(117, 26),
(57, 27),
(84, 27),
(93, 27),
(119, 27),
(30, 28),
(40, 28),
(49, 29),
(65, 29),
(98, 29),
(109, 29),
(56, 30),
(59, 30),
(73, 30),
(84, 30),
(114, 30),
(57, 31),
(104, 31),
(76, 32),
(108, 32),
(40, 33),
(48, 33),
(83, 33),
(91, 33),
(97, 33),
(115, 33),
(50, 34),
(95, 34),
(113, 34),
(19, 35),
(107, 35),
(102, 36),
(70, 37),
(88, 37),
(62, 38),
(64, 38),
(66, 38),
(68, 38),
(105, 38),
(60, 39),
(72, 40),
(55, 41),
(76, 41),
(79, 41),
(101, 41),
(30, 42),
(97, 42),
(120, 42),
(63, 43),
(72, 43),
(55, 44),
(93, 44),
(107, 44),
(43, 45),
(53, 45),
(57, 45),
(85, 45),
(118, 45),
(91, 46),
(97, 46),
(117, 46),
(46, 47),
(66, 47),
(68, 47),
(98, 47),
(99, 47),
(107, 47),
(124, 47),
(111, 48),
(60, 49),
(64, 50),
(98, 50),
(103, 50),
(104, 50),
(109, 50),
(112, 50),
(78, 51),
(99, 51),
(108, 51);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `country_movie`
--
ALTER TABLE `country_movie`
  ADD PRIMARY KEY (`id_movie`,`id_country`),
  ADD KEY `id_country` (`id_country`);

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `country_movie`
--
ALTER TABLE `country_movie`
  ADD CONSTRAINT `country_movie_ibfk_1` FOREIGN KEY (`id_movie`) REFERENCES `movie` (`id_movie`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `country_movie_ibfk_2` FOREIGN KEY (`id_country`) REFERENCES `country` (`id_country`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
