<?php

$servername = "localhost";
$username = "root";
$password = "mysql";
$dbname = "ivi";

$conn = new mysqli($servername, $username, $password, $dbname);


if ($conn->connect_error) {
    die("Ошибка подключения: " . $conn->connect_error);
}


$sql = "INSERT INTO country (name_country) VALUES
('Соединенные Штаты'),
('Китай'),
('Индия'),
('Россия'),
('Бразилия'),
('Япония'),
('Германия'),
('Индонезия'),
('Мексика'),
('Франция'),
('Великобритания'),
('Италия'),
('Турция'),
('Южная Корея'),
('Испания'),
('Канада'),
('Австралия'),
('Иран'),
('Аргентина'),
('Польша'),
('Южная Африка'),
('Нигерия'),
('Украина'),
('Малайзия'),
('Филиппины'),
('Колумбия'),
('Чили'),
('Нидерланды'),
('Бангладеш'),
('Швеция'),
('Вьетнам'),
('Эфиопия'),
('Египет'),
('Пакистан'),
('Румыния'),
('Бельгия'),
('Казахстан'),
('Греция'),
('Чехия'),
('Португалия'),
('Венесуэла'),
('Израиль'),
('Швейцария'),
('Саудовская Аравия'),
('Австрия'),
('Таиланд'),
('Перу'),
('Норвегия'),
('ОАЭ'),
('Дания')
";


if ($conn->query($sql) === TRUE) {
    echo "Данные успешно добавлены в таблицу languages.";
} else {
    echo "Ошибка: " . $sql . "<br>" . $conn->error;
}

$conn->close();
?>